---
title: ViewPrintingEventArgs
classe: Autodesk.Revit.DB.Events.ViewPrintingEventArgs
namespace: Autodesk.Revit.DB.Events
eredita: Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# ViewPrintingEventArgs

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Int32 Index { get; }` | `viewPrintingEventArgs.Index` | Int32 |
| `Int32 TotalViews { get; }` | `viewPrintingEventArgs.TotalViews` | Int32 |
| `View View { get; }` | `viewPrintingEventArgs.View` | View |
| `IPrintSetting GetSettings()` | `viewPrintingEventArgs.GetSettings()` | IPrintSetting |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```